cukier/MaxHeadron/sdkconfig.defaults
# Max Headron - ESP32, SSD1306 OLED.
# NOTE: esptool detected this specific board has 2MB of flash, not 4MB -
# set to match actual hardware (mismatched flash_size in the image header
# can confuse the bootloader's mmap/cache setup).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Animation runs the CPU harder than a typical blinky example; give it headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000
